"""Создайте словарь {'a': 1, 'b': 2}. Добавьте ключ 'c' со значением 3, затем увеличьте 'a' на 5."""
dictionary = {'a': 1, 'b': 2}
dictionary['c'] = 3
dictionary['a'] += 5
print(dictionary)

